Table of Contents
 Class IdeaBend
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaBend : AbstractIdeaObject<IIdeaBend>, IEquatable<AbstractIdeaObject<IIdeaBend>>, IIdeaBend, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaBend>
IdeaBend
Implements
IEquatable<AbstractIdeaObject<IIdeaBend>>
IIdeaBend
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaBend>.Id
 AbstractIdeaObject<IIdeaBend>.Name
 AbstractIdeaObject<IIdeaBend>.Identifier
 AbstractIdeaObject<IIdeaBend>.GetHashCode()
 AbstractIdeaObject<IIdeaBend>.Equals(object)
 AbstractIdeaObject<IIdeaBend>.Equals(AbstractIdeaObject<IIdeaBend>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaBend(Identifier<IIdeaBend>)
protected IdeaBend(Identifier<IIdeaBend> identifer)
Parameters
identifer Identifier<IIdeaBend>
 IdeaBend(int)
public IdeaBend(int id)
Parameters
id int
 IdeaBend(string)
public IdeaBend(string id)
Parameters
id string
Properties
 EndFaceNormal
End Face Normal
public IdeaVector3D EndFaceNormal { get; set; }
Property Value
IdeaVector3D
 LineOnSideBoundary1
Line on side of bend boundary
public IIdeaLineSegment3D LineOnSideBoundary1 { get; set; }
Property Value
IIdeaLineSegment3D
 LineOnSideBoundary2
Line on other side of bend boundary
public IIdeaLineSegment3D LineOnSideBoundary2 { get; set; }
Property Value
IIdeaLineSegment3D
 Plate1
first plate
public IIdeaPlate Plate1 { get; set; }
Property Value
IIdeaPlate
 Plate2
second plate
public IIdeaPlate Plate2 { get; set; }
Property Value
IIdeaPlate
 Radius
Radius
public double Radius { get; set; }
Property Value
double
 Edit this page